andyelsen85-bit/Range-Master/artifacts/firmware/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── PSRAM ─────────────────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ── MIPI DSI ──────────────────────────────────────────────────────────────
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── HTTP client ───────────────────────────────────────────────────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ── NVS ───────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── UART ──────────────────────────────────────────────────────────────────
CONFIG_UART_ISR_IN_IRAM=y

# ── Log level ─────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Partition table ───────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── Stack sizes ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
